In [1]:
import pandas as pd

marking_sheet=pd.DataFrame(
    {
        "Names":["John","Jane","Doe","Smith"],
        "English":[50,60,70,80],
        "Math":[30,40,50,60],
        "Science":[60,70,80,90],
    }
)

print(marking_sheet)

   Names  English  Math  Science
0   John       50    30       60
1   Jane       60    40       70
2    Doe       70    50       80
3  Smith       80    60       90

In [2]:
marking_sheet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Names    4 non-null      object
 1   English  4 non-null      int64
 2   Math     4 non-null      int64
 3   Science  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [3]:
marking_sheet.describe()

         English       Math    Science
count   4.000000   4.000000   4.000000
mean   65.000000  45.000000  75.000000
std    12.909944  12.909944  12.909944
min    50.000000  30.000000  60.000000
25%    57.500000  37.500000  67.500000
50%    65.000000  45.000000  75.000000
75%    72.500000  52.500000  82.500000
max    80.000000  60.000000  90.000000

In [4]:
marking_sheet.to_csv("marking_sheet.csv",index=False)

In [5]:
marking_sheet.head()

   Names  English  Math  Science
0   John       50    30       60
1   Jane       60    40       70
2    Doe       70    50       80
3  Smith       80    60       90